app/views/tasks/_form.html.erb

SELECT `authors`.* FROM `authors`
---
  <%= f.label :author %><br />
  <%= f.select :author_id, Author.all.map {|a| [a.name, a.id]}, :prompt=>"--Choose an author--" %>