app/views/tasks/index.html.erb

SELECT `authors`.* FROM `authors` WHERE `authors`.`id` = 1 LIMIT 1
---
        <td>
          <%= image_tag task.author.photo.url(:thumb), :style=>"float:left;" if task.author.photo.exists? %>