app/controllers/authors_controller.rb

  def index
   @authors = Author.all
---
SELECT `authors`.* FROM `authors`

  def edit
    @author = Author.find params[:id]
---
SELECT `authors`.* FROM `authors` WHERE `authors`.`id` = 1 LIMIT 1

  def update
      @author = Author.find(params[:id])
      if @author.update_attributes(params[:author])
---
SELECT `authors`.* FROM `authors` WHERE `authors`.`id` = 1 LIMIT 1
UPDATE `authors` SET `name` = 'Bart', `photo_file_name` = 'bart.gif', `photo_content_type` = 'image/gif', `photo_file_size` = 22492, `photo_updated_at` = '2012-07-25 19:54:23', `updated_at` = '2012-07-25 19:54:24' WHERE `authors`.`id` = 1

   def show
     @author = Author.find(params[:id])
---
SELECT `authors`.* FROM `authors` WHERE `authors`.`id` = 0 LIMIT 1