app/controllers/tasks_controller.rb

   def index
   @tasks = Task.all
---
SELECT `tasks`.* FROM `tasks`

  def edit
    @task = Task.find params[:id]
---
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 1 LIMIT 1

  def update
      @task = Task.find(params[:id])
      if @task.update_attributes(params[:task])
---
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 1 LIMIT 1
UPDATE `tasks` SET `description` = 'Buy milk 2 l', `updated_at` = '2012-07-29 16:26:24' WHERE `tasks`.`id` = 2

  def destroy
    @task = Task.find(params[:id])
    @task.destroy
---
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 7 LIMIT 1
DELETE FROM `tasks` WHERE `tasks`.`id` = 7